list_posts_by_rating/app/controllers/posts_controller.rb

INSERT INTO "posts" ("upvotes", "downvotes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["upvotes", 0], ["downvotes", 0], ["created_at", "2023-08-17 17:20:45.826200"], ["updated_at", "2023-08-17 17:20:45.826200"]]
---
    def create
        Post.create()

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "posts" SET "upvotes" = COALESCE("upvotes", 0) + ? WHERE "posts"."id" = ?  [["upvotes", 1], ["id", 9]]
---
    def upvote
        @post = Post.find(params[:id])
        @post.increment!(:upvotes, 1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "posts" SET "downvotes" = COALESCE("downvotes", 0) - ? WHERE "posts"."id" = ?  [["downvotes", 1], ["id", 9]]
---
    def downvote
        @post = Post.find(params[:id])
        @post.increment!(:downvotes, 1)