1-development/blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY rating desc, votes desc, updated_at desc
---
  def index
    @articles = Article.all.order("rating desc, votes desc, created_at desc")

INSERT INTO "articles" ("title", "body", "upvotes", "downvotes", "created_at", "updated_at", "rating", "votes") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    # Not sure if this initialisation should be done here.
    @article.upvotes = 0
    @article.downvotes = 0
    @article.votes = 0
    @article.rating = 0

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "articles" SET "upvotes" = ?, "updated_at" = ?, "rating" = ?, "votes" = ? WHERE "articles"."id" = ?  [["upvotes", 1], ["updated_at", "2021-01-10 18:52:57.395587"], ["rating", 5], ["votes", 5], ["id", 4]]
---
  def upvote
    @article = Article.find(params[:id])
    @article.upvote
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "downvotes" = ?, "updated_at" = ?, "rating" = ?, "votes" = ? WHERE "articles"."id" = ?  [["downvotes", 1], ["updated_at", "2021-01-10 18:52:52.298192"], ["rating", 9], ["votes", 1], ["id", 4]]
---
  def downvote
    @article = Article.find(params[:id])
    @article.downvote
    if @article.save