app/controllers/audits_controller.rb

SELECT "audits".* FROM "audits" WHERE "audits"."auditable_id" = $1 AND (created_at::date >= '2023-08-05'
---
  def show
    query = Audit.where(auditable_id: params[:id])
                 .where("created_at::date >= '#{params[:start_date] || Date.today}'
                        AND created_at::date <= '#{params[:end_date] || Date.today}'")
                 .where(field: params[:field])
                 .order(created_at: :asc)